org/roam/software_virt.org
:PROPERTIES:
:ID:       4462b218-52ce-4445-b1ae-42ff24faf0d6
:END:
#+title: software-virt
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container content
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* Virtualization
Simulate the simulation
- containers
  - [[id:90cf48a5-3b01-4667-b100-72acea67034f][podman]]
  - [[id:ab1f8872-ab90-4855-98a0-5d9bf5806d78][kind]]
- [[id:b066a88d-c1c4-43d4-b8b8-cc345ad8467f][firejail]]
- qemu
  - ~-M microvm~
  - binfmt for running binaries for other archs
  - ovmf/vfio for gpu pass through to vms
    - must have second card as sharing/virtualization is not supported on older cards
      - vGpus are [[https://github.com/DualCoder/vgpu_unlock][software locked]] but available as cloud offerings (grid etc)
      - https://github.com/Arc-Compute/LibVF.IO for supported cards
      - https://github.com/OpenMdev/GVM-user for supported cards
  - ~free-page-reporting=on~ to return guest memory to host (disable transparent huge pages on the guest as they will never be freed)
#+NAME: qemu-run-script
#+BEGIN_SRC shell :tangle no
#!/usr/bin/env bash
qemu-system-x86_64 -nic user,model=virtio-net-pci,hostfwd=tcp::8081-:8081,hostfwd=tcp::8080-:8080 -enable-kvm -m 2570 -device virtio-blk,drive=myhd -drive if=none,file=/My-image.qcow2,id=myhd -spice port=5930,disable-ticketing

qemu-system-x86_64 -enable-kvm \
        -cpu host \
        -drive file=WindowsVM.img,if=virtio \
        -nic user,model=virtio-net-pci,hostfwd=tcp::10022-:9022 \
        -m 4G -vga qxl -spice port=5930,disable-ticketing=on \
        -audiodev alsa,id=snd0,out.try-poll=off -device ich9-intel-hda -device hda-output,audiodev=snd0 \
        -name "Windows" \
        "$@"
#        -monitor stdio \
        #-audio driver=sdl,model=virtio \
# use cdrom drive and add virtio drivers
#./run-windows.sh -boot d -drive file=w10prox64.iso,media=cdrom -drive file=virtio-win-0.1.240.iso,media=cdrom # https://github.com/virtio-win/virtio-win-pkg-scripts/blob/master/README.md for kvm virtio drivers
# -device virtio-sound-pci,audiodev=my_audiodev -audiodev alsa,id=my_audiodev

#+END_SRC
- firecracker
  - 5.10 lts kernel
  - snapshots for faster boot after creation
- mesa opengl env var ~LIBGL_ALWAYS_SOFTWARE=true~
- ebpf
  - non turing complete register vm
  - CO-RE and BTF for portability
  - tools
    - [[id:a07e64d0-5cee-451a-af80-3f6c006dd0a1][bpftrace]]
    - [[id:bee863b2-bd4f-4332-a227-976b3cef1e45][bcc]]
