docs/software_virt.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>software-virt</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container content">
<nav class="navbar is-black" id="org810c96c">
<div class="navbar-brand" id="org6b9038f">
<div class="navbar-item" id="orga454de2">
<p>
<a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a>
</p>

</div>

</div>
<div class="navbar-menu" id="org1c1c7ff">
<div class="navbar-start" id="orgd9ce4cd">
<div class="navbar-item" id="orgcd00aec">
<p>
<a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a>
</p>

</div>

</div>
<div class="navbar-end" id="org3b065e0">

</div>

</div>
</nav>
<div id="outline-container-org2a45c14" class="outline-2">
<h2 id="org2a45c14">Virtualization</h2>
<div class="outline-text-2" id="text-org2a45c14">
<p>
Simulate the simulation
</p>
<ul class="org-ul">
<li>containers
<ul class="org-ul">
<li><a href="podman.html#ID-90cf48a5-3b01-4667-b100-72acea67034f">podman</a></li>
<li><a href="kind.html#ID-ab1f8872-ab90-4855-98a0-5d9bf5806d78">kind</a></li>
</ul></li>
<li><a href="firejail.html#ID-b066a88d-c1c4-43d4-b8b8-cc345ad8467f">firejail</a></li>
<li>qemu
<ul class="org-ul">
<li><code>-M microvm</code></li>
<li>binfmt for running binaries for other archs</li>
<li>ovmf/vfio for gpu pass through to vms
<ul class="org-ul">
<li>must have second card as sharing/virtualization is not supported on older cards
<ul class="org-ul">
<li>vGpus are <a href="https://github.com/DualCoder/vgpu_unlock">software locked</a> but available as cloud offerings (grid etc)</li>
<li><a href="https://github.com/Arc-Compute/LibVF.IO">https://github.com/Arc-Compute/LibVF.IO</a> for supported cards</li>
<li><a href="https://github.com/OpenMdev/GVM-user">https://github.com/OpenMdev/GVM-user</a> for supported cards</li>
</ul></li>
</ul></li>
<li><code>free-page-reporting=on</code> to return guest memory to host (disable transparent huge pages on the guest as they will never be freed)</li>
</ul></li>
</ul>
<div class="org-src-container">
<pre class="src src-shell" id="org71acf30">#!/usr/bin/env bash
qemu-system-x86_64 -nic user,model=virtio-net-pci,hostfwd=tcp::8081-:8081,hostfwd=tcp::8080-:8080 -enable-kvm -m 2570 -device virtio-blk,drive=myhd -drive if=none,file=/My-image.qcow2,id=myhd -spice port=5930,disable-ticketing
</pre>
</div>
<ul class="org-ul">
<li>firecracker
<ul class="org-ul">
<li>5.10 lts kernel</li>
<li>snapshots for faster boot after creation</li>
</ul></li>
<li>mesa opengl env var <code>LIBGL_ALWAYS_SOFTWARE=true</code></li>
<li>ebpf
<ul class="org-ul">
<li>non turing complete register vm</li>
<li>CO-RE and BTF for portability</li>
<li>tools
<ul class="org-ul">
<li><a href="bpftrace.html#ID-a07e64d0-5cee-451a-af80-3f6c006dd0a1">bpftrace</a></li>
<li><a href="bcc.html#ID-bee863b2-bd4f-4332-a227-976b3cef1e45">bcc</a></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
</div>
</body>
</html>